microblog/app/views/partials/_comment_view.erb

SELECT "comments".* FROM "comments" WHERE "comments"."blog_id" = ?  [["blog_id", 1]]
---
<ul>
  <% @blog.comments.each do |comment| %>