microblog/app/controllers/blogs_controller.rb

  def index
    @blogs = Blog.all
---
SELECT "blogs".* FROM "blogs"

  def create
    blog = Blog.create(blog_params)
---
INSERT INTO "blogs" ("title", "body", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Goods"], ["body", "Article"], ["status", nil], ["created_at", "2022-08-01 08:39:14.596509"], ["updated_at", "2022-08-01 08:39:14.596509"]]

  def edit
    @blog = Blog.find(params[:id])
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def update
    @blog = Blog.find(params[:id])
    @blog.update(blog_params)
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "blogs" SET "status" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["status", "1"], ["updated_at", "2022-08-01 08:59:08.843155"], ["id", 1]]

  def destroy
    @blog = Blog.find(params[:id])
    @blog.destroy
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "blogs" WHERE "blogs"."id" = ?  [["id", 3]]

  def show
    @blog = Blog.find(params[:id])
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]

  def change_status
    @blog = Blog.find(params[:id])
    @blog.update(blog_params)
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
UPDATE "blogs" SET "status" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["status", "0"], ["updated_at", "2022-08-01 11:35:07.673054"], ["id", 1]]