microblog/app/controllers/comments_controller.rb

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "blog_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "kiran"], ["body", "test"], ["blog_id", 1], ["created_at", "2022-08-08 10:22:54.840961"], ["updated_at", "2022-08-08 10:22:54.840961"]]
---
    def create
        @blog = Blog.find(params[:blog_id])
        @comment = @blog.comments.create(comment_params)